Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/xc32/PIC32CX1025MTSH128/startup_pic32cx1025mtsh128.c
#else /* Legacy defined(_32CX1025MTSH128_H) */
        /* Configurable interrupts with Legacy names */
        /* .pfnSUPC_Handler         = */ (void*) SUPC_Handler,        /* 0  Supply Controller */
        /* .pfnRSTC_Handler         = */ (void*) RSTC_Handler,        /* 1  Reset Controller */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-time Clock */
        /* .pfnRTT_Handler          = */ (void*) RTT_Handler,         /* 3  Real-time Timer */
        /* .pfnDWDT0_Handler        = */ (void*) DWDT0_Handler,       /* 4  Dual Watchdog Timer */
        /* .pfnDWDT1_Handler        = */ (void*) DWDT1_Handler,       /* 5  Dual Watchdog Timer */
        /* .pfnPMC_Handler          = */ (void*) PMC_Handler,         /* 6  Power Management Controller */
        /* .pfnSEFC0_Handler        = */ (void*) SEFC0_Handler,       /* 7  Secure Embedded Flash Controller */
        /* .pfnSEFC1_Handler        = */ (void*) SEFC1_Handler,       /* 8  Secure Embedded Flash Controller */
        /* .pfnFLEXCOM0_Handler     = */ (void*) FLEXCOM0_Handler,    /* 9  Flexible Serial Communication */
        /* .pfnFLEXCOM1_Handler     = */ (void*) FLEXCOM1_Handler,    /* 10 Flexible Serial Communication */
        /* .pfnFLEXCOM2_Handler     = */ (void*) FLEXCOM2_Handler,    /* 11 Flexible Serial Communication */
        /* .pfnFLEXCOM3_Handler     = */ (void*) FLEXCOM3_Handler,    /* 12 Flexible Serial Communication */
        /* .pfnFLEXCOM4_Handler     = */ (void*) FLEXCOM4_Handler,    /* 13 Flexible Serial Communication */
        /* .pfnFLEXCOM5_Handler     = */ (void*) FLEXCOM5_Handler,    /* 14 Flexible Serial Communication */
        /* .pfnFLEXCOM6_Handler     = */ (void*) FLEXCOM6_Handler,    /* 15 Flexible Serial Communication */
        /* .pfnFLEXCOM7_Handler     = */ (void*) FLEXCOM7_Handler,    /* 16 Flexible Serial Communication */
        /* .pfnPIOA_Handler         = */ (void*) PIOA_Handler,        /* 17 Parallel Input/Output Controller */
        /* .pfnPIOA_SEC_Handler     = */ (void*) PIOA_SEC_Handler,    /* 18 Parallel Input/Output Controller */
        /* .pfnPIOB_Handler         = */ (void*) PIOB_Handler,        /* 19 Parallel Input/Output Controller */
        /* .pfnPIOB_SEC_Handler     = */ (void*) PIOB_SEC_Handler,    /* 20 Parallel Input/Output Controller */
        /* .pfnPIOC_Handler         = */ (void*) PIOC_Handler,        /* 21 Parallel Input/Output Controller */
        /* .pfnPIOC_SEC_Handler     = */ (void*) PIOC_SEC_Handler,    /* 22 Parallel Input/Output Controller */
        /* .pfnQSPI_Handler         = */ (void*) QSPI_Handler,        /* 23 Quad Serial Peripheral Interface */
        /* .pfnADC_Handler          = */ (void*) ADC_Handler,         /* 24 Analog-to-Digital Converter */
        /* .pfnACC_Handler          = */ (void*) ACC_Handler,         /* 25 Analog Comparator Controller */
        /* .pvReserved26            = */ (void*) (0UL),               /* 26 Reserved */
        /* .pvReserved27            = */ (void*) (0UL),               /* 27 Reserved */
        /* .pfnIPC0_Handler         = */ (void*) IPC0_Handler,        /* 28 Inter-processor Communication */
        /* .pfnSLCDC_Handler        = */ (void*) SLCDC_Handler,       /* 29 Segment LCD Controller */
        /* .pfnMEM2MEM0_Handler     = */ (void*) MEM2MEM0_Handler,    /* 30 Memory to Memory */
        /* .pfnTC0_CHANNEL0_Handler = */ (void*) TC0_CHANNEL0_Handler, /* 31 Timer Counter */
        /* .pfnTC0_CHANNEL1_Handler = */ (void*) TC0_CHANNEL1_Handler, /* 32 Timer Counter */
        /* .pfnTC0_CHANNEL2_Handler = */ (void*) TC0_CHANNEL2_Handler, /* 33 Timer Counter */
        /* .pfnTC1_CHANNEL0_Handler = */ (void*) TC1_CHANNEL0_Handler, /* 34 Timer Counter */
        /* .pfnTC1_CHANNEL1_Handler = */ (void*) TC1_CHANNEL1_Handler, /* 35 Timer Counter */
        /* .pfnTC1_CHANNEL2_Handler = */ (void*) TC1_CHANNEL2_Handler, /* 36 Timer Counter */
        /* .pfnTC2_CHANNEL0_Handler = */ (void*) TC2_CHANNEL0_Handler, /* 37 Timer Counter */
        /* .pfnTC2_CHANNEL1_Handler = */ (void*) TC2_CHANNEL1_Handler, /* 38 Timer Counter */
        /* .pfnTC2_CHANNEL2_Handler = */ (void*) TC2_CHANNEL2_Handler, /* 39 Timer Counter */
        /* .pfnTC0_C0SEC_Handler    = */ (void*) TC0_C0SEC_Handler,   /* 40 Timer Counter */
        /* .pfnTC0_C1SEC_Handler    = */ (void*) TC0_C1SEC_Handler,   /* 41 Timer Counter */
        /* .pfnTC0_C2SEC_Handler    = */ (void*) TC0_C2SEC_Handler,   /* 42 Timer Counter */
        /* .pfnTC1_C0SEC_Handler    = */ (void*) TC1_C0SEC_Handler,   /* 43 Timer Counter */
        /* .pfnTC1_C1SEC_Handler    = */ (void*) TC1_C1SEC_Handler,   /* 44 Timer Counter */
        /* .pfnTC1_C2SEC_Handler    = */ (void*) TC1_C2SEC_Handler,   /* 45 Timer Counter */
        /* .pfnTC2_C0SEC_Handler    = */ (void*) TC2_C0SEC_Handler,   /* 46 Timer Counter */
        /* .pfnTC2_C1SEC_Handler    = */ (void*) TC2_C1SEC_Handler,   /* 47 Timer Counter */
        /* .pfnTC2_C2SEC_Handler    = */ (void*) TC2_C2SEC_Handler,   /* 48 Timer Counter */
        /* .pfnAES_Handler          = */ (void*) AES_Handler,         /* 49 Advanced Encryption Standard */
        /* .pfnAES_AESSEC_Handler   = */ (void*) AES_AESSEC_Handler,  /* 50 Advanced Encryption Standard */
        /* .pfnAESB_Handler         = */ (void*) AESB_Handler,        /* 51 Advanced Encryption Standard Bridge */
        /* .pfnAESB_AESBSEC_Handler = */ (void*) AESB_AESBSEC_Handler, /* 52 Advanced Encryption Standard Bridge */
        /* .pfnSHA_Handler          = */ (void*) SHA_Handler,         /* 53 Secure Hash Algorithm */
        /* .pfnSHA_SHASEC_Handler   = */ (void*) SHA_SHASEC_Handler,  /* 54 Secure Hash Algorithm */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 55 True Random Number Generator */
        /* .pfnTRNG_TRNGSEC_Handler = */ (void*) TRNG_TRNGSEC_Handler, /* 56 True Random Number Generator */
        /* .pfnICM_Handler          = */ (void*) ICM_Handler,         /* 57 Integrity Check Monitor */
        /* .pfnICM_ICMSEC_Handler   = */ (void*) ICM_ICMSEC_Handler,  /* 58 Integrity Check Monitor */
        /* .pfnCPKCC_Handler        = */ (void*) CPKCC_Handler,       /* 59 Classic Public Key Cryptography Controller */
        /* .pfnMATRIX0_Handler      = */ (void*) MATRIX0_Handler,     /* 60 AHB Bus Matrix */
        /* .pfnMATRIX1_Handler      = */ (void*) MATRIX1_Handler,     /* 61 AHB Bus Matrix */
        /* .pfnSUPC_WKUP3_Handler   = */ (void*) SUPC_WKUP3_Handler,  /* 62 Supply Controller */
        /* .pfnSUPC_WKUP4_Handler   = */ (void*) SUPC_WKUP4_Handler,  /* 63 Supply Controller */
        /* .pfnSUPC_WKUP5_Handler   = */ (void*) SUPC_WKUP5_Handler,  /* 64 Supply Controller */
        /* .pfnSUPC_WKUP6_Handler   = */ (void*) SUPC_WKUP6_Handler,  /* 65 Supply Controller */
        /* .pfnSUPC_WKUP7_Handler   = */ (void*) SUPC_WKUP7_Handler,  /* 66 Supply Controller */
        /* .pfnSUPC_WKUP8_Handler   = */ (void*) SUPC_WKUP8_Handler,  /* 67 Supply Controller */
        /* .pfnSUPC_WKUP9_Handler   = */ (void*) SUPC_WKUP9_Handler,  /* 68 Supply Controller */
        /* .pfnSUPC_WKUP10_Handler  = */ (void*) SUPC_WKUP10_Handler, /* 69 Supply Controller */
        /* .pfnSUPC_WKUP11_Handler  = */ (void*) SUPC_WKUP11_Handler, /* 70 Supply Controller */
        /* .pfnSUPC_WKUP12_Handler  = */ (void*) SUPC_WKUP12_Handler, /* 71 Supply Controller */
        /* .pfnSUPC_WKUP13_Handler  = */ (void*) SUPC_WKUP13_Handler, /* 72 Supply Controller */
        /* .pfnSUPC_WKUP14_Handler  = */ (void*) SUPC_WKUP14_Handler, /* 73 Supply Controller */
        /* .pfnSUPC_WKUP15_Handler  = */ (void*) SUPC_WKUP15_Handler, /* 74 Supply Controller */
        /* .pvReserved75            = */ (void*) (0UL),               /* 75 Reserved */
        /* .pfnEMAFE_SLINK_Handler  = */ (void*) EMAFE_SLINK_Handler, /* 76 Energy Metering Analog Front End */
        /* .pfnEMAFE_DATA_Handler   = */ (void*) EMAFE_DATA_Handler,  /* 77 Energy Metering Analog Front End */
        /* .pfnMEM2MEM1_Handler     = */ (void*) MEM2MEM1_Handler,    /* 78 Memory to Memory */
        /* .pfnTC3_CHANNEL0_Handler = */ (void*) TC3_CHANNEL0_Handler, /* 79 Timer Counter */
        /* .pfnTC3_CHANNEL1_Handler = */ (void*) TC3_CHANNEL1_Handler, /* 80 Timer Counter */
        /* .pfnTC3_CHANNEL2_Handler = */ (void*) TC3_CHANNEL2_Handler, /* 81 Timer Counter */
        /* .pfnTC3_C0SEC_Handler    = */ (void*) TC3_C0SEC_Handler,   /* 82 Timer Counter */
        /* .pfnTC3_C1SEC_Handler    = */ (void*) TC3_C1SEC_Handler,   /* 83 Timer Counter */
        /* .pfnTC3_C2SEC_Handler    = */ (void*) TC3_C2SEC_Handler,   /* 84 Timer Counter */
        /* .pfnPIOD_Handler         = */ (void*) PIOD_Handler,        /* 85 Parallel Input/Output Controller */
        /* .pfnPIOD_SEC_Handler     = */ (void*) PIOD_SEC_Handler,    /* 86 Parallel Input/Output Controller */
        /* .pfnUART_Handler         = */ (void*) UART_Handler,        /* 87 Universal Asynchronous Receiver Transmitter */
        /* .pfnIPC1_Handler         = */ (void*) IPC1_Handler,        /* 88 Inter-processor Communication */
        /* .pfnMCSPI_Handler        = */ (void*) MCSPI_Handler,       /* 89 Multi Channel Serial Peripheral Interface */
        /* .pfnPWM_Handler          = */ (void*) PWM_Handler,         /* 90 Pulse Width Modulation Controller */
        /* .pvReserved91            = */ (void*) (0UL),               /* 91 Reserved */
        /* .pvReserved92            = */ (void*) (0UL),               /* 92 Reserved */
        /* .pvReserved93            = */ (void*) (0UL),               /* 93 Reserved */
        /* .pfnMATRIX2_Handler      = */ (void*) MATRIX2_Handler,     /* 94 AHB Bus Matrix */
        /* .pfnMATRIX3_Handler      = */ (void*) MATRIX3_Handler      /* 95 AHB Bus Matrix */
#endif
};

#if (__ARM_FP==14) || (__ARM_FP==4)
/* These functions are used only when compiling with -mfloat-abi=softfp or -mfloat-abi=hard */
/* Save and restore IRQs */
typedef uint32_t irqflags_t;
static bool g_interrupt_enabled;
#define cpu_irq_is_enabled()    (__get_PRIMASK() == 0)
#  define cpu_irq_enable()                             \
        do {                                           \
                g_interrupt_enabled = true;            \
                __DMB();                               \
                __enable_irq();                        \
        } while (0)
#  define cpu_irq_disable()                            \
        do {                                           \
                __disable_irq();                       \
                __DMB();                               \
                g_interrupt_enabled = false;           \
        } while (0)
__always_inline __STATIC_INLINE bool __attribute__((optimize("-O1"))) cpu_irq_is_enabled_flags(irqflags_t flags)
{
        return (flags);
}
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) cpu_irq_restore(irqflags_t flags)
{
        if (cpu_irq_is_enabled_flags(flags))
                cpu_irq_enable();
}
__always_inline __STATIC_INLINE __attribute__((optimize("-O1"))) irqflags_t cpu_irq_save(void)
{
        volatile irqflags_t flags = cpu_irq_is_enabled();
        cpu_irq_disable();
        return flags;
}

/** Address for ARM CPACR */
#define ADDR_CPACR 0xE000ED88
/** CPACR Register */
#define REG_CPACR  (*((volatile uint32_t *)ADDR_CPACR))

/**
* \brief Enable FPU
*/
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) fpu_enable(void)
{
    irqflags_t flags;
    flags = cpu_irq_save();
    REG_CPACR |=  (0xFu << 20);
    __DSB();
    __ISB();
    cpu_irq_restore(flags);
}
#endif /* (__ARM_FP==14) || (__ARM_FP==4) */
 
